[
    {
        "packageName":"ActiveMQ",
        "description":"Apache ActiveMQ is an open source message broker written in Java together with a full Java Message Service (JMS) client https://activemq.apache.org/zos",
        "version":""
    },
    {
        "packageName":"Ansible",
        "description":"Ansible is an automation tool for configuration and deployment of software https://www.ansible.com/integrations/infrastructure/ibm-zos",
        "version":""
    },
    {
        "packageName":"Apache Spark",
        "description":"Apache Spark is an analytics engine for large-scale data processing https://developer.ibm.com/javasdk/downloads/spark/",
        "version":""
    },
    {
        "packageName":"Artifactory-vault",
        "description":"Ambitus hosted set of examples and use cases for Jfrog's Artifactory, along with how-to information for deploying on Linux o z/OS",
        "version":""
    },
    {
        "packageName":"Bash",
        "description":"RocketSoftware hosted Bash is an sh-compatible shell providing users a command-line interpreter that provides a traditional interface via text window and a script execution capability. It is the default shell on Linux and Mac OS X.",
        "version":""
    },
    {
        "packageName":"binutils",
        "description":"Ambitus hosted port of the GNU binutils to z/OS",
        "version":""
    },
    {
        "packageName":"Bison",
        "description":"RocketSoftware hosted Bison is a programming utility for creating parsers. It's commonly used in both build automation and build automation generation, and converts annotated context-free grammar into a C, C++, or Java parser. Bison is used by PHP, Bash, Ruby, and many other tools",
        "version":""
    }
    ,
    {
        "packageName":"Bzip2",
        "description":"RocketSoftware hosted bzip2 is a data compressor that compresses single files (it is not a file archiver). It typically compresses files to within 10% to 15% of the best available techniques of statistical compressors, while being around twice as fast at compression and six times faster at decompression. This version of bzip2 was not written to exploit z Systems architecture; gzip may work best for these needs.",
        "version":""
    },
    {
        "packageName":"cics-bundle-common",
        "description":"Gradle plugins to build CICS bundles https://github.com/IBM/cics-bundle-gradle",
        "version":""
    },
    {
        "packageName":"cics-bundle-maven",
        "description":"Maven plugin to build CICS bundles ibm.github.io/cics-bundle-maven",
        "version":""
    },
    {
        "packageName":"Conda",
        "description":"Package, dependency and environment management https://anaconda.org/IzODA/repo",
        "version":""
    },
    {
        "packageName":"cURL",
        "description":"RocketSoftware hosted cURL is an open source tool that can transfer data to and from servers by using one of the supported protocols (HTTP, HTTPS, FTP, FTPS, TFTP, DICT, TELNET, LDAP, or FILE). This tool can work without user interaction. cURL functionality includes proxy support, user authentication, FTP upload, HTTP post, SSL connections, cookies, file transfer, resume, and more.",
        "version":""
    },
    {
        "packageName":"Diffutils",
        "description":"RocketSoftware hosted Diffutils is a package of several programs intended to find differences between files. The diff command, for example, shows exact line differences between two files.",
        "version":""
    },
    {
        "packageName":"Galasa",
        "description":"Galasa is an integration test framework https://github.com/galasa-dev",
        "version":""
    }
    ,
    {
        "packageName":"GCC",
        "description":"Ambitus hosted port of the GNU GCC compiler to z/OS",
        "version":""
    },
    {
        "packageName":"GenevaERS",
        "description":"GenevaERS is the single-pass optimization engine for data extraction and reporting on z/OS.",
        "version":""
    },
    {
        "packageName":"Git",
        "description":"Git is a version control system (VCS) for tracking changes in computer files and coordinating work on those files among multiple people https://www.rocketsoftware.com/zos-open-source/tools",
        "version":""
    },
    {
        "packageName":"Glibc",
        "description":"Ambitus hosted port of the GNU C library to z/OS",
        "version":""
    },
    {
        "packageName":"Gzip",
        "description":"RocketSoftware hosted Gzip is a popular data compression/decompression program (our ported tools have been compressed using this utility). This version of Gzip has also been modified to exploit z/OS EDC compression hardware, if present on your system.",
        "version":""
    },
    {
        "packageName":"Java",
        "description":"Popular object-oriented programming language https://developer.ibm.com/javasdk/support/zos/",
        "version":""
    }
    ,
    {
        "packageName":"Libssh2",
        "description":"RocketSoftware hosted libssh2 is a software library that allows developers to use the SSH-2 network protocol in an easy-to-use self-contained package. This package only contains LIBSSH2 libraries intended for use by other programs or utilities",
        "version":""
    },
    {
        "packageName":"M4",
        "description":"RocketSoftware hosted M4 is a general-purpose macro processor. Most users require M4 simply as a dependency of Autoconf or Bison, although the language is used in other contexts such as text template re-use, text editing and text-processing applications.",
        "version":""
    },
    {
        "packageName":"Make",
        "description":"RocketSoftware hosted Make controls the generation of program executables and other non-source files from the program's source files. Make allows users to build, install and update packages without knowing the process details",
        "version":""
    },
    {
        "packageName":"Mktemp",
        "description":"RocketSoftware hosted the mktemp utility takes a given filename template and overwrites a portion of it to create a unique filename. Mktemp also manages the creation of temporary files and directories that allow the user to avoid the cleaning up files that are not needed permanently.",
        "version":""
    },
    {
        "packageName":"Node.js",
        "description":"JavaScript runtime built on Chrome's V8 JavaScript engine https://github.com/ibmruntimes/node",
        "version":""
    },
    {
        "packageName":"Open Liberty",
        "description":"A lightweight open framework for building fast and efficient cloud-native Java microservices. https://openliberty.io",
        "version":""
    },
    {
        "packageName":"OpenSSL",
        "description":"RocketSoftware hosted OpenSSL is a software library to be used in applications that need to secure communications against eavesdropping or need to ascertain the identity of the party at the other end.",
        "version":""
    },
    {
        "packageName":"Perl",
        "description":"Perl is a general-purpose, interpreted, dynamic programming language https://www.rocketsoftware.com/zos-open-source",
        "version":""
    },
    {
        "packageName":"PHP",
        "description":"PHP is a server-side scripting language, offering a simple and universal solution for easy-to-program dynamic Web pages https://www.rocketsoftware.com/zos-open-source",
        "version":""
    },
    {
        "packageName":"Pkg-Config",
        "description":"RocketSoftware hosted pkg-Config is a programming tool that assists with compiling applications and libraries. It helps you insert the correct compiler options on the command line without the need of hard coding values on where to find glib (or other libraries).",
        "version":""
    },
    {
        "packageName":"Polycephaly",
        "description":"Polycephaly enables developers to build z/OS source code files with Jenkins and Git",
        "version":""
    },
    {
        "packageName":"Python",
        "description":"Open Enterprise Python is an industry-standard Python interpreter for z/OS https://developer.ibm.com/mainframe/2020/06/22/python-for-zos-now-available/",
        "version":""
    },
    {
        "packageName":"Pyzklin",
        "description":"Amibitus hosted Python interfaces for resource management on z/OS. A place to create building blocks for workflows and pipelines",
        "version":""
    },
    {
        "packageName":"R",
        "description":"R is a functional language for primarily for data analytics https://www.rocketsoftware.com/product-categories/mainframe/r-for-zos",
        "version":""
    }
    ,
    {
        "packageName":"Sed",
        "description":"RocketSoftware hosted sed (stream editor) is a utility for parsing and transforming text. It is typically used for extracting part of a file using pattern matching, or substituting multiple occurrences of a string within a file.",
        "version":""
    },
    {
        "packageName":"Sudo",
        "description":"RocketSoftware hosted sudo is a command-line utility that allows admins to delegate authority, giving certain users the ability to run commands as a super-user or another user, while providing an audit trail of the commands and their arguments.",
        "version":""
    },
    {
        "packageName":"Unzip",
        "description":"RocketSoftware hosted UnZip is an extraction utility for archives compressed in .zip format. Unzip is also compatible with PKZIP and PKUNZIP utilities for MS-DOS as well as Info-ZIPs and supports bzip2 compression methods as well.",
        "version":""
    }
    ,
    {
        "packageName":"Vim",
        "description":"RocketSoftware hosted Vim is a highly configurable text editor built to make creating and changing any kind of text very efficient.",
        "version":""
    },
    {
        "packageName":"zECS",
        "description":"Enterprise Caching System (zECS) is a cloud enabled distributed key/value pair caching service https://github.com/walmartlabs/zECS",
        "version":""
    },
    {
        "packageName":"Zip",
        "description":"RocketSoftware hosted Zip is a compression and file packaging/archive utility. Zip puts one or more compressed files into a single ZIP archive, along with information about the files.",
        "version":""
    },
    {
        "packageName":"Zlib",
        "description":"RocketSoftware hosted zlib is a general-purpose, lossless data compression library providing in-memory compression and decompression functions, including integrity checks of the uncompressed data.",
        "version":""
    },
    {
        "packageName":"zML",
        "description":"Ambitus hosted programing language agnostic macro description format. Provides access to external published z/OS data areas through a markup language interface",
        "version":""
    },
    {
        "packageName":"Zorow",
        "description":"z/OS Open Repository of Workflows (zorow), is dedicated to contributing and collaborating on z/OSMF workflows.",
        "version":""
    },
    {
        "packageName":"zos-native",
        "description":"Ambitus hosted tools, examples, and how-to information for working in a z/OS USS environment. Geared toward Linux users who need to inow how to use z/OS",
        "version":""
    },
    {
        "packageName":"Zowe",
        "description":"Zowe, modern interfaces to interact with z/OS, allows to work with z/OS in a way that is similar to what you experience on cloud platforms today https://www.zowe.org/download.html",
        "version":""
    },
    {
        "packageName":"zTron",
        "description":"Ambitus hosted lightweight pipeline framework for creating Python workflows as standalone application and/or Jupyter notebooks",
        "version":""
    }
    ]
